<a href="https://colab.research.google.com/github/samz5320/dollar_tasks/blob/main/Intern_Data_Analyst_Tasks_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>



#q1 Standardise the mail_sent_date column values to YYYY-MM-DD standard date format

In [1]:
#q1
import pandas as pd
email_df=pd.read_excel("https://github.com/samz5320/discover-dollor-datasets/blob/main/Emails%20sent.xlsx?raw=true")

email_df["mail_sent_date"] = pd.to_datetime(email_df["mail_sent_date"]).dt.strftime('%Y-%m-%d')

email_df["mail_sent_date"].head(10)

0    2009-05-22
1    2010-04-17
2    2012-01-26
3    2014-11-15
4    2014-07-17
5    2010-02-22
6    2010-07-17
7    2012-10-27
8    2014-01-18
9    2010-01-11
Name: mail_sent_date, dtype: object

#q2 In which Year maximum number of emails were sent to doctors?

In [2]:
#q2
count=pd.to_datetime(email_df['mail_sent_date']).dt.year.value_counts()
print(count)

2014    32
2015    31
2019    25
2016    25
2010    25
2018    23
2013    21
2011    20
2012    16
2007    15
2009    14
2017    11
2008     8
2020     5
2006     1
Name: mail_sent_date, dtype: int64

#Preprocessing inital

In [3]:

import pandas as pd
df=pd.read_csv("https://raw.githubusercontent.com/samz5320/discover-dollor-datasets/main/Fines%20paid%20%20by%20doctors.csv")

In [4]:
cash_fine=pd.Series(df[" cash_fine "])
online_fine=pd.Series(df[" online_fine "])

In [5]:
cash_fine=pd.to_numeric(cash_fine.replace("[^0-9\.]","",regex=True),errors='coerce')
online_fine=pd.to_numeric(online_fine.replace("[^0-9\.]","",regex=True),errors='coerce')
df[" cash_fine "]=cash_fine
df[" online_fine "]=online_fine

In [6]:
df[" cash_fine "]

0        2625.0
1        1000.0
2           NaN
3           NaN
4        1800.0
          ...
10082    1750.0
10083       NaN
10084       NaN
10085    2000.0
10086       NaN
Name:  cash_fine , Length: 10087, dtype: float64

In [7]:
df[" cash_fine "]=df[" cash_fine "].fillna(0)
df[" online_fine "]=df[" online_fine "].fillna(0)

In [8]:
df.head()

                  org_indiv first_name  ...  cash_fine   online_fine
0  3-D MEDICAL SERVICES LLC     STEVEN  ...      2625.0           0.0
1          AA DOCTORS, INC.     AAKASH  ...      1000.0           0.0
2    ABBO, LILIAN MARGARITA     LILIAN  ...         0.0         448.0
3    ABBO, LILIAN MARGARITA     LILIAN  ...         0.0         119.0
4    ABBO, LILIAN MARGARITA     LILIAN  ...      1800.0           0.0

[5 rows x 8 columns]

In [9]:
df["new_fine"]=df[" cash_fine "]+df[" online_fine "]
new_df=df
df["new_fine"]=df[" cash_fine "]+df[" online_fine "]
new_df=df
new_df.head()

                  org_indiv first_name  ...  online_fine  new_fine
0  3-D MEDICAL SERVICES LLC     STEVEN  ...           0.0   2625.0
1          AA DOCTORS, INC.     AAKASH  ...           0.0   1000.0
2    ABBO, LILIAN MARGARITA     LILIAN  ...         448.0    448.0
3    ABBO, LILIAN MARGARITA     LILIAN  ...         119.0    119.0
4    ABBO, LILIAN MARGARITA     LILIAN  ...           0.0   1800.0

[5 rows x 9 columns]

In [10]:
new_df=new_df.drop(labels=[" cash_fine "," online_fine "],axis=1)

In [11]:
new_df.head()

                  org_indiv first_name  ...                 category new_fine
0  3-D MEDICAL SERVICES LLC     STEVEN  ...    Professional Advising   2625.0
1          AA DOCTORS, INC.     AAKASH  ...        Expert-Led Forums   1000.0
2    ABBO, LILIAN MARGARITA     LILIAN  ...  Business Related Travel    448.0
3    ABBO, LILIAN MARGARITA     LILIAN  ...                    Meals    119.0
4    ABBO, LILIAN MARGARITA     LILIAN  ...    Professional Advising   1800.0

[5 rows x 7 columns]

#q3 Write a query to get total fine paid per Office

In [12]:
#q3
fine_per_office=new_df.groupby(["org_indiv"]).sum().sort_values("new_fine")
fine_per_office.head()

                       new_fine
org_indiv
JOSEPH SOLOMKIN, M.D.     500.0
RICHARD A RENZA DO PA     500.0
MASRI, ADDAM              500.0
HOFFMAN, JOHN MALCOLM     500.0
FIDONE, JEFFREY W         500.0

In [13]:
len(new_df["org_indiv"].unique())

4851

#q4 Write a query to get the highest total fine and lowest total fine paid per state

In [14]:
#4
df.groupby("state").agg(
    s_min=pd.NamedAgg(column="new_fine", aggfunc="min"),
    s_max=pd.NamedAgg(column="new_fine", aggfunc="max"))

        s_min      s_max
state
AK     1750.0     1750.0
AL       26.0   232991.0
AR       26.0    77670.0
AZ       26.0   151642.0
CA       25.0   323122.0
CO       31.0   282565.0
CT       25.0   132853.0
DC       25.0    62000.0
DE       36.0    19750.0
FL       25.0  1185466.0
GA       25.0   101734.0
HI      102.0     6500.0
IA       26.0   123375.0
ID       33.0     7000.0
IL       25.0   160984.0
IN       26.0    40500.0
KS       29.0    70000.0
KY       26.0   137642.0
LA       27.0    42000.0
MA       29.0   617548.0
MD       26.0   171986.0
ME       42.0     6000.0
MI       26.0   152466.0
MN       25.0   146623.0
MO       26.0    88302.0
MS       34.0     8500.0
MT       29.0     4350.0
NC        0.0   857698.0
ND       63.0     4450.0
NE       25.0    50449.0
NH       96.0    78000.0
NJ       25.0    88087.0
NM       60.0    18750.0
NV       25.0     9200.0
NY       25.0   100000.0
OH       25.0   107292.0
OK       37.0     7250.0
OR       27.0   186490.0
PA       25.0   672263.0
PR       26.0    20175.0
RI       28.0    65278.0
SC       26.0   117225.0
SD       66.0     7750.0
TN       27.0   177786.0
TX       25.0   479314.0
UT       27.0   224997.0
VA       36.0    38102.0
VT       40.0    11153.0
WA       31.0    46660.0
WI       25.0   131863.0
WV       28.0    19500.0
WY       27.0     7750.0

#q5 Write a query to get the least 2 states that had to pay minimum 'online' fine

In [15]:
#5
df_min=df.groupby("state").agg(
    s_min=pd.NamedAgg(column=" online_fine ", aggfunc="sum"))

df_min.sort_values(by="s_min",ascending=True)

          s_min
state
AK          0.0
ND        321.0
ME       3006.0
MT       3108.0
VT       3235.0
WY       3337.0
NM       3955.0
DE       4440.0
ID       4681.0
SD       5603.0
NV       6699.0
OK       7733.0
AR       7801.0
NE       8388.0
HI       9170.0
MS      11026.0
IA      11774.0
NH      13649.0
OR      16928.0
PR      17230.0
WV      22269.0
RI      22694.0
KS      24539.0
SC      25891.0
UT      26065.0
AZ      28683.0
CT      29959.0
CO      30784.0
LA      33857.0
KY      34019.0
DC      38872.0
VA      39627.0
AL      39771.0
WA      43237.0
IN      45119.0
WI      45522.0
MN      47321.0
MD      50994.0
MO      52821.0
NJ      61758.0
GA      65325.0
TN      66544.0
MI      77365.0
IL      91497.0
NC      99278.0
PA     108374.0
OH     124170.0
MA     159396.0
FL     163166.0
TX     215149.0
NY     224630.0
CA     406290.0

#q6 Write a SQL query to find the number of doctors that contributed to the state having highest 'cash' fine

In [16]:
      pip install pandasql

Requirement already satisfied: pandasql in /usr/local/lib/python3.7/dist-packages (0.7.3)
Requirement already satisfied: sqlalchemy in /usr/local/lib/python3.7/dist-packages (from pandasql) (1.4.22)
Requirement already satisfied: pandas in /usr/local/lib/python3.7/dist-packages (from pandasql) (1.1.5)
Requirement already satisfied: numpy in /usr/local/lib/python3.7/dist-packages (from pandasql) (1.19.5)
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.7/dist-packages (from pandas->pandasql) (2018.9)
Requirement already satisfied: python-dateutil>=2.7.3 in /usr/local/lib/python3.7/dist-packages (from pandas->pandasql) (2.8.2)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.7/dist-packages (from python-dateutil>=2.7.3->pandas->pandasql) (1.15.0)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.7/dist-packages (from sqlalchemy->pandasql) (1.1.1)
Requirement already satisfied: importlib-metadata in /usr/local/lib/python3.7/dist-packages (from sqlalchemy->pandasql) (4.6.4)
Requirement already satisfied: zipp>=0.5 in /usr/local/lib/python3.7/dist-packages (from importlib-metadata->sqlalchemy->pandasql) (3.5.0)
Requirement already satisfied: typing-extensions>=3.6.4 in /usr/local/lib/python3.7/dist-packages (from importlib-metadata->sqlalchemy->pandasql) (3.7.4.3)

In [17]:
#6
import pandasql as ps
import pandas as pd
dfsql=df.drop(labels=["new_fine"],axis=1)
dfsql["cash_fine"]=df[" cash_fine "]

dfsql=dfsql.drop(labels=[' cash_fine '],axis=1)
dfsql
#q1 = """select count(*), state from dfsql where (select distinct state GROUP BY "state" ORDER BY sum("cash_fine") DESC);"""
q2="""select count(*) as doctors,state from (select distinct first_name,last_name,state from dfsql group by state order by sum(cash_fine));"""
#print(ps.sqldf(q1, locals()))
print(ps.sqldf(q2, locals()))

   doctors state
0       52    CA

In [18]:
#verifying
df_max=df.groupby("state").agg(
    s_min=pd.NamedAgg(column=" cash_fine ", aggfunc="sum"))

df_max.sort_values(by="s_min",ascending=False)

           s_min
state
CA     4331517.0
TX     2587047.0
FL     2400881.0
PA     2376131.0
NC     2229157.0
NY     1840412.0
MA     1605375.0
IL     1165328.0
MI     1068920.0
MO      920765.0
OH      895280.0
CO      884454.0
MD      819911.0
TN      782681.0
AL      641928.0
AZ      613168.0
CT      602323.0
GA      553320.0
NJ      539084.0
MN      527479.0
WI      464600.0
KY      402919.0
SC      395600.0
UT      354827.0
WA      352829.0
VA      328365.0
IN      305220.0
OR      286812.0
KS      282666.0
IA      231932.0
LA      228064.0
DC      211669.0
NE      191862.0
RI      187510.0
NH      158720.0
AR      153131.0
PR      113164.0
WV      106103.0
OK      103790.0
MS       74250.0
NV       66325.0
NM       59875.0
DE       49547.0
WY       36625.0
HI       33447.0
ID       32975.0
VT       26653.0
SD       23900.0
ND       15825.0
ME       15725.0
MT        8100.0
AK        1750.0

#q7Get the top 5 average fine paid per state and category

In [19]:
#q7 method1
top_paid=new_df.groupby(["state","category"]).mean().sort_values("new_fine", ascending=False)
top_paid.head(5)

                                                               new_fine
state category
UT    Infosys Sponsored Research initiated before Jul...  224997.000000
OR    Infosys Sponsored Research initiated before Jul...  186490.000000
FL    Infosys Sponsored Research initiated on or afte...  181115.571429
TN    Infosys Sponsored Research initiated on or afte...  177786.000000
PA    Investigator-Initiated Research                     150778.000000

In [20]:
#q7 method 2
top_paid2=df.groupby(["state","category"]).agg(
    s_mean=pd.NamedAgg(column="new_fine", aggfunc="mean"))

top_paid2.sort_values(by="s_mean",ascending=False)

                                                                 s_mean
state category
UT    Infosys Sponsored Research initiated before Jul...  224997.000000
OR    Infosys Sponsored Research initiated before Jul...  186490.000000
FL    Infosys Sponsored Research initiated on or afte...  181115.571429
TN    Infosys Sponsored Research initiated on or afte...  177786.000000
PA    Investigator-Initiated Research                     150778.000000
...                                                                 ...
KY    Educational Items                                       57.000000
TN    Educational Items                                       54.166667
MS    Educational Items                                       49.285714
MN    Educational Items                                       47.000000
NC    Educational Items                                       31.000000

[318 rows x 1 columns]

#EDA

In [21]:
import matplotlib.pyplot as plt
import seaborn as sns

dfsql.describe()

        online_fine      cash_fine
count   10087.000000  1.008700e+04
mean      266.389412  3.240799e+03
std       860.948875  2.181475e+04
min         0.000000  0.000000e+00
25%         0.000000  0.000000e+00
50%        41.000000  0.000000e+00
75%       262.000000  2.000000e+03
max     27681.000000  1.185466e+06

In [22]:
#total records under each category
new_df.columns
print(new_df.category.unique())
print("----------------------")
print(new_df.category.value_counts())

['Professional Advising' 'Expert-Led Forums' 'Business Related Travel'
 'Meals' 'Educational Items'
 'Infosys Sponsored Research initiated before July 1, 2009'
 'Infosys Sponsored Research initiated on or after July 1, 2009'
 'Investigator-Initiated Research' nan]
----------------------
Meals                                                            3100
Expert-Led Forums                                                2857
Business Related Travel                                          2152
Professional Advising                                            1525
Infosys Sponsored Research initiated before July 1, 2009          203
Educational Items                                                 171
Infosys Sponsored Research initiated on or after July 1, 2009      44
Investigator-Initiated Research                                    34
Name: category, dtype: int64

In [23]:
#city category wise total fine descending
category_wise=new_df.loc[:,["city","category","new_fine"]]
city_cat_fine=category_wise.sort_values("new_fine",ascending=False)
city_cat_fine.columns=["city","category","total_fine"]
city_cat_fine.head()

            city                                           category  total_fine
6160       MIAMI  Infosys Sponsored Research initiated on or aft...   1185466.0
2331      DURHAM  Infosys Sponsored Research initiated before Ju...    857698.0
9299  PITTSBURGH  Infosys Sponsored Research initiated before Ju...    672263.0
1966      BOSTON  Infosys Sponsored Research initiated before Ju...    617548.0
9314     HOUSTON  Infosys Sponsored Research initiated before Ju...    479314.0

In [24]:
#sum of diff types of fines
print("sum of fines in cash",df[' cash_fine '].sum())
print("sum of fines paid online",df[" online_fine "].sum())

sum of fines in cash 32689941.0
sum of fines paid online 2687070.0